InformationRegisters/ПрикрепляемыеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепляемыеФайлы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементФайлы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтроки_</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПрикрепитьФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПрикрепитьФайлы</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ОбещанныеПлатежи</xr:Item>
				<xr:Item>Document.НеподтвержденныеПлатежи</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
				<xr:Item>Catalog.ФССП_ИсполнительноеПроизводство</xr:Item>
				<xr:Item>Document.СудебноеДело</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепляемыеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторКорреспонденции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементФайлы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Comment>Файлы в папках</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияДатаМодификацииФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияНомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьСертификатыШифрования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПрикрепляемыеФайлы/Ext/ManagerModule.bsl
#Область Интерфейс

Функция СоздатьФайлыВКонфигурации(ВыделенныеСтроки) Экспорт

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;

	ВременныеФайлы = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока.Регистратор) <> Тип("ДокументСсылка.ПрикрепитьФайлы") Тогда
		
			ВызватьИсключение 
				"Не правильный тип регистратора"
				+ "Тип регистратора: " + ТипЗнч(ВыделеннаяСтрока.Регистратор);
		
		КонецЕсли;
			
		Попытка
		
			ВременныйФайл = СоздатьВременныйФайл(ВыделеннаяСтрока);
			ВременныйФайл.Вставить("Регистратор", ВыделеннаяСтрока.Регистратор);
		
		Исключение
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки;

		ВременныеФайлы.Добавить(ВременныйФайл);
		
	КонецЦикла;
	
	СсылкиНаФайлы = Новый Массив;
	Для каждого ВременныйФайл Из ВременныеФайлы Цикл
	
		Результат = СоздатьФайлПоСтрокеРегистра(ВременныйФайл);
		ДанныеОФайле = Новый Структура;
		ДанныеОФайле.Вставить("Файл", Результат);
		ДанныеОФайле.Вставить("УИД", ВременныйФайл["УИД"]);
		ДанныеОФайле.Вставить("Регистратор", ВременныйФайл["Регистратор"]);
		СсылкиНаФайлы.Добавить(ДанныеОФайле);
	
	КонецЦикла;
	
	Возврат СсылкиНаФайлы;

КонецФункции

Функция СоздатьФайлПоСтрокеРегистра(ВременныйФайл) Экспорт

	Папка = Справочники.ПапкиФайлов.Подписание;
	ПолноеИмяФайла = ВременныйФайл["Путь"];
	Файл = Новый Файл(ПолноеИмяФайла);
	ИмяФайлаБезРасширения = Файл.ИмяБезРасширения;
	Расширение = СтрЗаменить(Файл.Расширение, ".", "");
	
	ПараметрыФайла = РаботаСФайламиСлужебныйКлиентСервер.ПараметрыДобавленияФайла();
	ПараметрыФайла["Автор"] = Пользователи.ТекущийПользователь();
	ПараметрыФайла["ВладелецФайлов"] = Папка;
	ПараметрыФайла["ИмяБезРасширения"] = ИмяФайлаБезРасширения;
	ПараметрыФайла["РасширениеБезТочки"] = Расширение;

	Попытка
	
		АдоесХранилища = ВременныйФайл["Хранилище"];
		ФайлСсылка = РаботаСФайламиСлужебныйВызовСервера.ДобавитьФайл(ПараметрыФайла, АдоесХранилища);
	
	Исключение
		ВызватьИсключение
			ОписаниеОшибки()
			+ "Не удалось создать файл: " + Файл.Имя;
	КонецПопытки;
	
	Возврат ФайлСсылка;

КонецФункции // ()

// Возвращает краткое имя файла по Регистратору и Номеру строки
// Если Имя файла не удалось определить, возвращает пустую строку
Функция ИмяФайлаПоРегистратору(Регистратор, НомерСтроки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикрепляемыеФайлы.ИмяФайла КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.ПрикрепляемыеФайлы КАК ПрикрепляемыеФайлы
		|ГДЕ
		|	ПрикрепляемыеФайлы.Регистратор = &Регистратор
		|	И ПрикрепляемыеФайлы.НомерСтроки_ = &НомерСтроки_";
	
	Запрос.УстановитьПараметр("НомерСтроки_", НомерСтроки);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.ИмяФайла;
		
	КонецЕсли;
	
	Возврат "";

КонецФункции // ()

// Возвращает Ссылку на элемент справочника Файлы по Регистратору и Номеру строки
// Если Имя файла не удалось определить, возвращает пустую строку
Функция СсылкаФайлПоРегистратору(Регистратор, НомерСтроки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикрепляемыеФайлы.ЭлементФайлы КАК ЭлементФайлы
		|ИЗ
		|	РегистрСведений.ПрикрепляемыеФайлы КАК ПрикрепляемыеФайлы
		|ГДЕ
		|	ПрикрепляемыеФайлы.Регистратор = &Регистратор
		|	И ПрикрепляемыеФайлы.НомерСтроки_ = &НомерСтроки_
		|	И ПрикрепляемыеФайлы.ЭлементФайлы ССЫЛКА Справочник.Файлы";
	
	Запрос.УстановитьПараметр("НомерСтроки_", НомерСтроки);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.ЭлементФайлы;
		
	КонецЕсли;
	
	Возврат Справочники.Файлы.ПустаяСсылка();

КонецФункции // ()

// По строке регистра сведений Прикрепляемые файлы возвращает
// Структуру данных с полями УИД и БинарныеДанные
//
// ВыбраннаяСтрока - строка регистра сведений Прикрепляемые файлы
//
// ДанныеФайла - Структура
//     УИД            - УИД файла из Документа ПрикрепитьФайлы
//     БинарныеДанные - Двоичные данные файла, если файлы хранятся в базе иначе Неопределено
Функция ДанныеФайла(ВыбраннаяСтрока) Экспорт
	
	Результат = НахождениеДанныхФайла(ВыбраннаяСтрока);
	
	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("УИД", Результат[0].УИД);
	ДанныеФайла.Вставить("БинарныеДанные", Результат[0].Хранилище.Получить());
	// Лебедева 22052024 - убрала, так как мешает работе открытия файлов после смены типа хранения - в базе или в каталогое
	//ФайлыНаСервере = Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить();
	//Если ФайлыНаСервере Тогда
	//
	//	ДанныеФайла["БинарныеДанные"] = Неопределено;
	//
	//КонецЕсли;

	Возврат ДанныеФайла;

КонецФункции

Функция СохраненныеФайлы(Основание) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрикрепляемыеФайлыСрезПоследних.ТипФайла КАК Тип,
	|	ПрикрепляемыеФайлыСрезПоследних.ИмяФайла КАК Имя,
	|	ПрикрепляемыеФайлыСрезПоследних.ЭлементФайлы КАК Идентификатор,
	|	ПрикрепляемыеФайлыСрезПоследних.Регистратор КАК СсылкаПрикрепления
	|ИЗ
	|	РегистрСведений.ПрикрепляемыеФайлы.СрезПоследних(
	|			,
	|			Объект = &Основание
	|				И ТИПЗНАЧЕНИЯ(ЭлементФайлы) = &ТипЭлементФайлы) КАК ПрикрепляемыеФайлыСрезПоследних";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ТипЭлементФайлы", Тип("Строка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции // ()

#КонецОбласти

Функция ПолучитьИмяФайла(ВыделеннаяСтрока)

	Регистратор = ВыделеннаяСтрока.Регистратор;
	НомерСтроки = ВыделеннаяСтрока.НомерСтроки_;
	
	ИмяФайла = ИмяФайлаПоРегистратору(Регистратор, НомерСтроки);
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
	
		ВызватьИсключение
			"Нет прикрепленного файла"
			+ "Данные запроса: "
			+ ВыделеннаяСтрока.Регистратор
			+ ", " + ВыделеннаяСтрока.НомерСтроки_;
	
	КонецЕсли;
	
	Возврат ИмяФайла;

КонецФункции // ()

Функция СоздатьВременныйФайл(ВыделеннаяСтрока)

	ВременныйФайл = Новый Структура;
	
	ДанныеФайла = ДанныеХраненияФайла(ВыделеннаяСтрока);
	ВременныйФайл.Вставить("УИД", ДанныеФайла["УИД"]);
	
	ВременныйКаталог = КаталогВременныхФайлов();
	ИмяФайла = ПолучитьИмяФайла(ВыделеннаяСтрока);
	ВременныйФайл.Вставить("ИмяФайла", ИмяФайла);
	ПолноеИмяФайла = СтандартныйВидКаталога(ВременныйКаталог) + ИмяФайла;
	ВременныйФайл.Вставить("Путь", ПолноеИмяФайла);
	
	ФайлыНаСервере = Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить();
	
	ВременныйФайл.Вставить("Хранилище", Неопределено);
	ДвоичныеДанные = Неопределено;
	Если ФайлыНаСервере Тогда
	
		Каталог = СтандартныйВидКаталога(Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить());
		ФайлПоИмени = Новый Файл(ПолноеИмяФайла);
		ИмяСохраненногоФайла = Каталог + ДанныеФайла["УИД"] + ФайлПоИмени.Расширение;
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяСохраненногоФайла);
	
	Иначе
	
		ДвоичныеДанные = ДанныеФайла["Хранилище"].Получить(); 
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДвоичныеДанные) Тогда
	
		ВызватьИсключение
			"Нет данных файла в хранилище"
			+ "Данные запроса: " + ИмяФайла;
	
	КонецЕсли;
	ВременныйФайл["Хранилище"] = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
	Возврат ВременныйФайл;

КонецФункции // ()

Функция СтандартныйВидКаталога(ПутьКаталога)

	Файл = Новый Файл(ПутьКаталога);
	Возврат Файл.ПолноеИмя + ПолучитьРазделительПути();

КонецФункции // ()

Функция ДанныеХраненияФайла(ВыбраннаяСтрока)

	Результат = НахождениеДанныхФайла(ВыбраннаяСтрока);
	
	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("УИД", Результат[0].УИД);
	ДанныеФайла.Вставить("Хранилище", Результат[0].Хранилище);

	Возврат ДанныеФайла;

КонецФункции // ()

Функция НахождениеДанныхФайла(ВыбраннаяСтрока)

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрикрепитьФайлыФайлы.Хранилище,
	|	ПрикрепитьФайлыФайлы.УИД
	|ИЗ
	|	Документ.ПрикрепитьФайлы.Файлы КАК ПрикрепитьФайлыФайлы
	|ГДЕ
	|	ПрикрепитьФайлыФайлы.Ссылка = &Ссылка
	|	И ПрикрепитьФайлыФайлы.НомерСтроки = &НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяСтрока.Регистратор);
	Запрос.УстановитьПараметр("НомерСтроки", ВыбраннаяСтрока.НомерСтроки_);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
	
		ВызватьИсключение
			"Нет прикрепленного файла"
			+ "Данные запроса: " + ВыбраннаяСтрока.Регистратор + ", " + ВыбраннаяСтрока.НомерСтроки_;
	
	КонецЕсли;
		
	Возврат Результат;

КонецФункции // ()
